modules/shells/freemacs-vterm.org
#+title: Vterm Configuration
#+author: Thomas Freeman
#+date: Time-stamp: <2022-07-07 17:21:24 thomas>
#+language: en_US
#+property: header-args :results silent :exports code

#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+keywords: Emacs
#+html_link_home: ../../index.html
#+html_link_up: ../../init.html
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)
#+html_head: <style>#org-div-home-and-up { text-align: right; padding-right: 10pt; }</style>

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup


* Vterm :guix:

Vterm is a terminal emulator in Emacs that is written in C and compiled on the host system. This makes it faster than than ~term~ or ~ansi-term~ in Emacs. It also replicates a traditional terminal more closely than the other options in Emacs.

#+begin_src emacs-lisp :tangle yes
  (use-package vterm
    :defer t)
#+end_src

* End

#+begin_src emacs-lisp :tangle yes
  (provide 'freemacs-vterm)

  ;;; freemacs-vterm.el ends here
#+end_src
